{
  "PAD": 0,
  "UNK": 1,
  "VAR_0": 2,
  "VAR_1": 3,
  "VAR_2": 4,
  "VAR_3": 5,
  "VAR_4": 6,
  "VAR_5": 7,
  "VAR_6": 8,
  "VAR_7": 9,
  "VAR_8": 10,
  "VAR_9": 11,
  "VAR_10": 12,
  "VAR_11": 13,
  "VAR_12": 14,
  "VAR_13": 15,
  "VAR_14": 16,
  "VAR_15": 17,
  "VAR_16": 18,
  "VAR_17": 19,
  "VAR_18": 20,
  "VAR_19": 21,
  "VAR_20": 22,
  "VAR_21": 23,
  "VAR_22": 24,
  "VAR_23": 25,
  "VAR_24": 26,
  "VAR_25": 27,
  "VAR_26": 28,
  "VAR_27": 29,
  "VAR_28": 30,
  "VAR_29": 31,
  "VAR_30": 32,
  "VAR_31": 33,
  "VAR_32": 34,
  "VAR_33": 35,
  "VAR_34": 36,
  "VAR_35": 37,
  "VAR_36": 38,
  "VAR_37": 39,
  "VAR_38": 40,
  "VAR_39": 41,
  "VAR_40": 42,
  "VAR_41": 43,
  "VAR_42": 44,
  "VAR_43": 45,
  "VAR_44": 46,
  "VAR_45": 47,
  "VAR_46": 48,
  "VAR_47": 49,
  "VAR_OTHER": 50,
  "FUNC_0": 51,
  "FUNC_1": 52,
  "FUNC_2": 53,
  "FUNC_3": 54,
  "FUNC_4": 55,
  "FUNC_5": 56,
  "FUNC_6": 57,
  "FUNC_7": 58,
  "FUNC_8": 59,
  "FUNC_9": 60,
  "FUNC_10": 61,
  "FUNC_11": 62,
  "FUNC_12": 63,
  "FUNC_13": 64,
  "FUNC_14": 65,
  "FUNC_15": 66,
  "FUNC_16": 67,
  "FUNC_17": 68,
  "FUNC_18": 69,
  "FUNC_19": 70,
  "FUNC_20": 71,
  "FUNC_21": 72,
  "FUNC_22": 73,
  "FUNC_23": 74,
  "FUNC_24": 75,
  "FUNC_25": 76,
  "FUNC_26": 77,
  "FUNC_27": 78,
  "FUNC_28": 79,
  "FUNC_29": 80,
  "FUNC_30": 81,
  "FUNC_31": 82,
  "FUNC_OTHER": 83,
  "PROPERTY_0": 84,
  "PROPERTY_1": 85,
  "PROPERTY_2": 86,
  "PROPERTY_3": 87,
  "PROPERTY_4": 88,
  "PROPERTY_5": 89,
  "PROPERTY_6": 90,
  "PROPERTY_7": 91,
  "PROPERTY_8": 92,
  "PROPERTY_9": 93,
  "PROPERTY_10": 94,
  "PROPERTY_11": 95,
  "PROPERTY_12": 96,
  "PROPERTY_13": 97,
  "PROPERTY_14": 98,
  "PROPERTY_15": 99,
  "PROPERTY_16": 100,
  "PROPERTY_17": 101,
  "PROPERTY_18": 102,
  "PROPERTY_19": 103,
  "PROPERTY_20": 104,
  "PROPERTY_21": 105,
  "PROPERTY_22": 106,
  "PROPERTY_23": 107,
  "PROPERTY_OTHER": 108,
  "STRING": 109,
  "SQL_STRING": 110,
  "FSTRING_SQL": 111,
  "NUMBER": 112,
  "UNSAFE_EXEC": 113,
  "SAFE_EXEC": 114,
  "SQL_CONCAT": 115,
  "WHITELIST_VAR": 116,
  "DB_LOADED_VAR": 117,
  "BOOLEAN_SINK": 118,
  "FSTRING_SQL_RAW": 119,
  "SAFE_PLACEHOLDER_LIST": 120,
  "SAFE_NUMERIC_VAR": 121,
  "SECOND_ORDER_FLOW": 122,
  "STORED_SQL_FRAGMENT": 123,
  "SQL_FRAGMENT_TO_SYNTAX": 124,
  "SAVED_SEGMENT": 125,
  "as": 126,
  "break": 127,
  "class": 128,
  "continue": 129,
  "def": 130,
  "elif": 131,
  "else": 132,
  "except": 133,
  "false": 134,
  "finally": 135,
  "for": 136,
  "from": 137,
  "function": 138,
  "if": 139,
  "import": 140,
  "lambda": 141,
  "new": 142,
  "none": 143,
  "null": 144,
  "pass": 145,
  "private": 146,
  "protected": 147,
  "public": 148,
  "return": 149,
  "static": 150,
  "true": 151,
  "try": 152,
  "void": 153,
  "while": 154,
  "with": 155,
  "=": 156,
  "+": 157,
  "-": 158,
  "*": 159,
  "/": 160,
  "%": 161,
  ".": 162,
  ",": 163,
  ":": 164,
  ";": 165,
  "(": 166,
  ")": 167,
  "{": 168,
  "}": 169,
  "[": 170,
  "]": 171,
  "<": 172,
  ">": 173,
  "!": 174,
  "==": 175,
  "!=": 176,
  "<=": 177,
  ">=": 178,
  "->": 179,
  "=>": 180,
  "++": 181,
  "--": 182,
  "?": 183,
  "??": 184,
  "|": 185,
  "&": 186,
  "||": 187,
  "&&": 188
}